cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/bundle"

brew "ack"
brew "antigen"
brew "composer"
brew "diff-so-fancy"
brew "git"
brew "git-open"
brew "grc"
brew "mariadb"
brew "mas"
brew "nginx"
brew "node"
brew "openssl"
brew "php"
brew "the_silver_searcher"
brew "unrar"
brew "wakatime-cli"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-completions"

# Applications
cask "1password"
cask "android-platform-tools"
cask "android-sdk"
cask "cyberduck"
cask "docker"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "hyper"
cask "java" unless system "/usr/libexec/java_home --failfast"
cask "poedit"
cask "postgres"
cask "postico"
cask "sequel-pro"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "the-unarchiver"
cask "tunnelblick"
cask "visual-studio-code"

# Fonts
cask "font-amatic-sc"
cask "font-hack"
cask "font-lato"
